Revit 2027 API
StructuralElementDefinitionData.StartShortening Property
 Cutback or extension at element curve start.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartShortening { get; }
Public ReadOnly Property StartShortening As Double
	Get
public:
property double StartShortening {
	double get ();
}
member StartShortening : float with get
Property Value
Double
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace